docs/software-engineering/language/how-to-learn-program-language.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>how to learn program language</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">how to learn program language</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org992bd29">1. 简介</a>
<ul>
<li><a href="#orgbbb833a">1.1. 起源</a></li>
<li><a href="#org9d90033">1.2. 优点</a></li>
<li><a href="#org4321324">1.3. 特性</a></li>
<li><a href="#org00fe3d7">1.4. 语言文化</a></li>
</ul>
</li>
<li><a href="#org8f65faa">2. 程序结构</a>
<ul>
<li><a href="#org4a53f1f">2.1. 总览</a></li>
<li><a href="#org4f44d39">2.2. 注释</a></li>
<li><a href="#orgb9a4784">2.3. 符号（token）</a>
<ul>
<li><a href="#org8b7d365">2.3.1. 字面常量</a></li>
<li><a href="#org2fe1494">2.3.2. 标识符</a>
<ul>
<li><a href="#org5bfb36a">2.3.2.1. 作用域</a></li>
<li><a href="#orgf4e1139">2.3.2.2. 生存期</a></li>
</ul>
</li>
<li><a href="#org969f64a">2.3.3. 关键字</a></li>
<li><a href="#org949a5bc">2.3.4. 运算符</a>
<ul>
<li><a href="#org51c712c">2.3.4.1. 算数运算符</a></li>
<li><a href="#orgb81ff73">2.3.4.2. 关系运算符</a></li>
<li><a href="#orga9a4fb9">2.3.4.3. 赋值运算符</a></li>
<li><a href="#orgf82a5e0">2.3.4.4. 逻辑运算符</a></li>
<li><a href="#orgfff1596">2.3.4.5. 位运算符</a></li>
<li><a href="#org04a1c9d">2.3.4.6. 其他</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org85668a6">2.4. 表达式</a></li>
<li><a href="#orga3488a1">2.5. 语句</a>
<ul>
<li><a href="#org1d48f0d">2.5.1. 声明与定义</a></li>
<li><a href="#orgc1fec5b">2.5.2. 赋值</a></li>
<li><a href="#orgaf7b4a7">2.5.3. 函数调用</a></li>
<li><a href="#orge246553">2.5.4. 执行控制</a>
<ul>
<li><a href="#org411d101">2.5.4.1. 分支</a></li>
<li><a href="#org8d41b57">2.5.4.2. 循环</a></li>
<li><a href="#org5c5cbf2">2.5.4.3. 跳转</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org09cbbbd">2.6. 函数</a>
<ul>
<li><a href="#org1fb4ef9">2.6.1. 传参</a></li>
<li><a href="#org89083af">2.6.2. 返回值</a></li>
<li><a href="#org5b99c8c">2.6.3. 闭包</a></li>
<li><a href="#orgf8f0e4f">2.6.4. 匿名函数</a></li>
</ul>
</li>
<li><a href="#org73471c4">2.7. 模块</a></li>
</ul>
</li>
<li><a href="#org05c12d8">3. 类型系统</a>
<ul>
<li><a href="#org4a40dc1">3.1. 数值类型</a></li>
<li><a href="#org64c092a">3.2. 字符类型</a></li>
<li><a href="#org1d82a00">3.3. 布尔类型</a></li>
<li><a href="#org0bb1ef5">3.4. 空类型</a></li>
<li><a href="#orgeb0d151">3.5. 存储类型</a></li>
<li><a href="#orga3cdc8d">3.6. 自定义类型</a></li>
<li><a href="#org9a82e1c">3.7. 类型转换</a></li>
</ul>
</li>
<li><a href="#orgde74225">4. 数据结构</a>
<ul>
<li><a href="#org025d558">4.1. 顺序</a></li>
<li><a href="#orgedd45d5">4.2. 关联</a></li>
<li><a href="#org43d589e">4.3. 迭代</a></li>
</ul>
</li>
<li><a href="#org12c27b3">5. 错误处理</a></li>
<li><a href="#orge11c9f8">6. 编码规范</a></li>
<li><a href="#org483b528">7. 高级特性</a>
<ul>
<li><a href="#org8c364e3">7.1. 闭包</a></li>
<li><a href="#org98eea9d">7.2. 模板</a></li>
<li><a href="#org5375850">7.3. 函数重载</a></li>
<li><a href="#org94541ab">7.4. 反射</a></li>
</ul>
</li>
<li><a href="#org798b31d">8. 程序库</a>
<ul>
<li><a href="#orgaf0d750">8.1. 內建函数</a></li>
<li><a href="#org1e75acc">8.2. 通用函数</a></li>
<li><a href="#orgba3888d">8.3. 数据类型</a></li>
<li><a href="#org5aec38c">8.4. 字符串</a></li>
<li><a href="#org43a52f4">8.5. 输入输出</a></li>
<li><a href="#orgcd6f9fd">8.6. 文件</a></li>
<li><a href="#orgcc3ea80">8.7. 日期</a></li>
<li><a href="#org132d13e">8.8. 日志</a></li>
<li><a href="#org72ed362">8.9. 数学</a></li>
<li><a href="#org97273eb">8.10. unit test</a></li>
</ul>
</li>
<li><a href="#org36697c9">9. 参考书籍</a>
<ul>
<li><a href="#org2fe2edf">9.1. 入门</a></li>
<li><a href="#orgdf827b8">9.2. 高级</a></li>
<li><a href="#orgd1c130c">9.3. 实践</a></li>
<li><a href="#orgb6ae932">9.4. 原理</a></li>
</ul>
</li>
<li><a href="#orgf98250f">10. 相关工具</a>
<ul>
<li><a href="#orgb4faeba">10.1. 安装运行</a></li>
<li><a href="#org4b27cf6">10.2. 标准命令</a></li>
<li><a href="#orgca5f1e2">10.3. 集成开发</a></li>
<li><a href="#org26c3465">10.4. 静态检查</a></li>
<li><a href="#orgb1dec53">10.5. 构建编译</a></li>
<li><a href="#org4dde641">10.6. 代码调试</a></li>
<li><a href="#org4db768f">10.7. 内存检查</a></li>
<li><a href="#org6c15431">10.8. 性能分析</a></li>
<li><a href="#orgade90ec">10.9. 自动测试</a></li>
<li><a href="#org3ae512f">10.10. 文档系统</a></li>
<li><a href="#org62e21dc">10.11. 包管理</a></li>
<li><a href="#org5da72ec">10.12. 其他工具</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org992bd29" class="outline-2">
<h2 id="org992bd29"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbbb833a" class="outline-3">
<h3 id="orgbbb833a"><span class="section-number-3">1.1</span> 起源</h3>
</div>
<div id="outline-container-org9d90033" class="outline-3">
<h3 id="org9d90033"><span class="section-number-3">1.2</span> 优点</h3>
</div>
<div id="outline-container-org4321324" class="outline-3">
<h3 id="org4321324"><span class="section-number-3">1.3</span> 特性</h3>
</div>
<div id="outline-container-org00fe3d7" class="outline-3">
<h3 id="org00fe3d7"><span class="section-number-3">1.4</span> 语言文化</h3>
</div>
</div>
<div id="outline-container-org8f65faa" class="outline-2">
<h2 id="org8f65faa"><span class="section-number-2">2</span> 程序结构</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4a53f1f" class="outline-3">
<h3 id="org4a53f1f"><span class="section-number-3">2.1</span> 总览</h3>
</div>
<div id="outline-container-org4f44d39" class="outline-3">
<h3 id="org4f44d39"><span class="section-number-3">2.2</span> 注释</h3>
<div class="outline-text-3" id="text-2-2">
<p>
分为单行注释、多行注释和行内注释。
</p>
<pre class="example">

</pre>
</div>
</div>

<div id="outline-container-orgb9a4784" class="outline-3">
<h3 id="orgb9a4784"><span class="section-number-3">2.3</span> 符号（token）</h3>
<div class="outline-text-3" id="text-2-3">
<p>
主要分为：字面常量（分配的匿名内存区域），标识符（分配内存区域的别名），关键字，运算符。
</p>
</div>

<div id="outline-container-org8b7d365" class="outline-4">
<h4 id="org8b7d365"><span class="section-number-4">2.3.1</span> 字面常量</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
一般来说，字面常量都有对应的内置类型，否则，应该如何定义这些类型。
</p>
</div>
</div>

<div id="outline-container-org2fe1494" class="outline-4">
<h4 id="org2fe1494"><span class="section-number-4">2.3.2</span> 标识符</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
标识符是用来标识变量、函数或其他 <b>用户自定义</b> 项目的名称。如常量名、变量名、函数名。
</p>

<p>
支持面向对象的语言，有的定义的标识符代表的就是一个对象，可以直接通过对象调用方法，如 Python，其实这可以理解为只是一个语法糖。
</p>
</div>

<div id="outline-container-org5bfb36a" class="outline-5">
<h5 id="org5bfb36a"><span class="section-number-5">2.3.2.1</span> 作用域</h5>
<div class="outline-text-5" id="text-2-3-2-1">
<p>
代码复用（函数，块）引入了作用域的概念。
</p>
<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-orgf4e1139" class="outline-5">
<h5 id="orgf4e1139"><span class="section-number-5">2.3.2.2</span> 生存期</h5>
<div class="outline-text-5" id="text-2-3-2-2">
<p>
内存分配回收引入了生存期的概念。
</p>
<pre class="example">

</pre>
</div>
</div>
</div>

<div id="outline-container-org969f64a" class="outline-4">
<h4 id="org969f64a"><span class="section-number-4">2.3.3</span> 关键字</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
语言保留，不能做标识符。关键字主要用于指引编译器如何分配内存（与类型相关的关键字）以及程序如何执行（分支，跳转，循环）。
</p>
</div>
</div>

<div id="outline-container-org949a5bc" class="outline-4">
<h4 id="org949a5bc"><span class="section-number-4">2.3.4</span> 运算符</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
需要注意的是优先级和结合律。
</p>
</div>

<div id="outline-container-org51c712c" class="outline-5">
<h5 id="org51c712c"><span class="section-number-5">2.3.4.1</span> 算数运算符</h5>
<div class="outline-text-5" id="text-2-3-4-1">
<p>
加、减、乘、除、mod、自增、自减
</p>
<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-orgb81ff73" class="outline-5">
<h5 id="orgb81ff73"><span class="section-number-5">2.3.4.2</span> 关系运算符</h5>
<div class="outline-text-5" id="text-2-3-4-2">
<p>
gt,ge,lt,le,eq,noteq
</p>
<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-orga9a4fb9" class="outline-5">
<h5 id="orga9a4fb9"><span class="section-number-5">2.3.4.3</span> 赋值运算符</h5>
<div class="outline-text-5" id="text-2-3-4-3">
<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-orgf82a5e0" class="outline-5">
<h5 id="orgf82a5e0"><span class="section-number-5">2.3.4.4</span> 逻辑运算符</h5>
<div class="outline-text-5" id="text-2-3-4-4">
<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-orgfff1596" class="outline-5">
<h5 id="orgfff1596"><span class="section-number-5">2.3.4.5</span> 位运算符</h5>
<div class="outline-text-5" id="text-2-3-4-5">
<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-org04a1c9d" class="outline-5">
<h5 id="org04a1c9d"><span class="section-number-5">2.3.4.6</span> 其他</h5>
<div class="outline-text-5" id="text-2-3-4-6">
<p>
三目运算符等。
</p>

<pre class="example">

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org85668a6" class="outline-3">
<h3 id="org85668a6"><span class="section-number-3">2.4</span> 表达式</h3>
<div class="outline-text-3" id="text-2-4">
<p>
表达式可以求值，表明表达式可以作为右值。
</p>
</div>
</div>

<div id="outline-container-orga3488a1" class="outline-3">
<h3 id="orga3488a1"><span class="section-number-3">2.5</span> 语句</h3>
<div class="outline-text-3" id="text-2-5">
<p>
语句是程序执行的最小逻辑单位。
</p>

<p>
语句与表达式的区别：语句不一定可以求值。
</p>

<p>
有的语言要求表达式以特定符号结尾，如 C/C++。
</p>

<p>
表达式主要有以下作用：
</p>
</div>

<div id="outline-container-org1d48f0d" class="outline-4">
<h4 id="org1d48f0d"><span class="section-number-4">2.5.1</span> 声明与定义</h4>
</div>
<div id="outline-container-orgc1fec5b" class="outline-4">
<h4 id="orgc1fec5b"><span class="section-number-4">2.5.2</span> 赋值</h4>
</div>
<div id="outline-container-orgaf7b4a7" class="outline-4">
<h4 id="orgaf7b4a7"><span class="section-number-4">2.5.3</span> 函数调用</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
有些语言中，可以调用的不一定是函数，也有可能是对象（python，C++），或者仿函数（C++）。
</p>
</div>
</div>

<div id="outline-container-orge246553" class="outline-4">
<h4 id="orge246553"><span class="section-number-4">2.5.4</span> 执行控制</h4>
<div class="outline-text-4" id="text-2-5-4">
</div>
<div id="outline-container-org411d101" class="outline-5">
<h5 id="org411d101"><span class="section-number-5">2.5.4.1</span> 分支</h5>
<div class="outline-text-5" id="text-2-5-4-1">
<pre class="example">
if-else switch-case-default
</pre>
</div>
</div>

<div id="outline-container-org8d41b57" class="outline-5">
<h5 id="org8d41b57"><span class="section-number-5">2.5.4.2</span> 循环</h5>
<div class="outline-text-5" id="text-2-5-4-2">
<pre class="example">
for while do-while
</pre>
</div>
</div>

<div id="outline-container-org5c5cbf2" class="outline-5">
<h5 id="org5c5cbf2"><span class="section-number-5">2.5.4.3</span> 跳转</h5>
<div class="outline-text-5" id="text-2-5-4-3">
<pre class="example">
break continue goto try-throw-catch return
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org09cbbbd" class="outline-3">
<h3 id="org09cbbbd"><span class="section-number-3">2.6</span> 函数</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-org1fb4ef9" class="outline-4">
<h4 id="org1fb4ef9"><span class="section-number-4">2.6.1</span> 传参</h4>
<div class="outline-text-4" id="text-2-6-1">
<ul class="org-ul">
<li>传值还是传引用</li>
<li>参数默认值如何设置</li>
<li>可变参数语法</li>
</ul>
</div>
</div>

<div id="outline-container-org89083af" class="outline-4">
<h4 id="org89083af"><span class="section-number-4">2.6.2</span> 返回值</h4>
<div class="outline-text-4" id="text-2-6-2">
<ul class="org-ul">
<li>返回值的作用域</li>
<li>返回值数量</li>
</ul>
</div>
</div>

<div id="outline-container-org5b99c8c" class="outline-4">
<h4 id="org5b99c8c"><span class="section-number-4">2.6.3</span> 闭包</h4>
</div>

<div id="outline-container-orgf8f0e4f" class="outline-4">
<h4 id="orgf8f0e4f"><span class="section-number-4">2.6.4</span> 匿名函数</h4>
</div>
</div>

<div id="outline-container-org73471c4" class="outline-3">
<h3 id="org73471c4"><span class="section-number-3">2.7</span> 模块</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>有的语言引入新的命名空间（C++ 的 namespace，Lua，Python），有的没有（C）</li>
<li>有的语言有包（模块）管理工具，如 python 的 pip，lua 的 luarocks，golang 的 go get，nodejs 的 npm，有的则没有，如 C++。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org05c12d8" class="outline-2">
<h2 id="org05c12d8"><span class="section-number-2">3</span> 类型系统</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4a40dc1" class="outline-3">
<h3 id="org4a40dc1"><span class="section-number-3">3.1</span> 数值类型</h3>
<div class="outline-text-3" id="text-3-1">
<p>
包括整数，浮点数，有的语言还扩展了虚数（如 python）等不常见的数值类型。
</p>

<p>
有的语言根据表示范围和精度对整数和浮点数做了进一步划分（如 C/C++），有的则没有（如 Lua）。
</p>

<p>
有些数值类型有对应的字面量表示方法，有的则没有（C/C++ uint32），这些数值类型的定义需要类型转换。
</p>

<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-org64c092a" class="outline-3">
<h3 id="org64c092a"><span class="section-number-3">3.2</span> 字符类型</h3>
<div class="outline-text-3" id="text-3-2">
<p>
有些语言的字符类型是其他类型的别名（C/C++），字面量要注意两点：
</p>

<p>
字符编码，如 utf-8
</p>
<pre class="example">

</pre>

<p>
转义字符
</p>
</div>
</div>

<div id="outline-container-org1d82a00" class="outline-3">
<h3 id="org1d82a00"><span class="section-number-3">3.3</span> 布尔类型</h3>
<div class="outline-text-3" id="text-3-3">
<p>
有些语言的布尔类型是其他类型的别名，有些则是独立的类型。要注意其他类型和布尔类型的比较。
</p>
<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-org0bb1ef5" class="outline-3">
<h3 id="org0bb1ef5"><span class="section-number-3">3.4</span> 空类型</h3>
<div class="outline-text-3" id="text-3-4">
<p>
有的语言有空类型，如 lua 和 golang 中的 nil，python 中的 None。
</p>
<pre class="example">

</pre>
</div>
</div>

<div id="outline-container-orgeb0d151" class="outline-3">
<h3 id="orgeb0d151"><span class="section-number-3">3.5</span> 存储类型</h3>
<div class="outline-text-3" id="text-3-5">
<p>
有的语言可以直接操作内存，如 C/C++中的指针。
</p>
<pre class="example">

</pre>
</div>
</div>

<div id="outline-container-orga3cdc8d" class="outline-3">
<h3 id="orga3cdc8d"><span class="section-number-3">3.6</span> 自定义类型</h3>
<div class="outline-text-3" id="text-3-6">
<p>
大多数语言都提供了工具可以自定义复杂的类型，如 C/C++中的 struct，Lua 中的 table，Python 中的 Class，golang 中的 struce 等。
</p>

<pre class="example">

</pre>

<p>
有的语言还提供了类型别名的方式，如 C/C++中的 typedef。
</p>
</div>
</div>

<div id="outline-container-org9a82e1c" class="outline-3">
<h3 id="org9a82e1c"><span class="section-number-3">3.7</span> 类型转换</h3>
<div class="outline-text-3" id="text-3-7">
<p>
有的语言支持部分类型间的自动转换。
</p>
</div>
</div>
</div>

<div id="outline-container-orgde74225" class="outline-2">
<h2 id="orgde74225"><span class="section-number-2">4</span> 数据结构</h2>
<div class="outline-text-2" id="text-4">
<p>
大部分语言都内置了一些简单的数据结构，如 C/C++ 的数组，Lua 的 table，Python 的 tuple、list，golang 的 map，slice。有的语言还可以通过外部工具库来支持（如 C++的 STL）。
</p>

<p>
这些数据结构主要分为：
</p>
</div>
<div id="outline-container-org025d558" class="outline-3">
<h3 id="org025d558"><span class="section-number-3">4.1</span> 顺序</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">

</pre>
</div>
</div>
<div id="outline-container-orgedd45d5" class="outline-3">
<h3 id="orgedd45d5"><span class="section-number-3">4.2</span> 关联</h3>
<div class="outline-text-3" id="text-4-2">
<p>
字典，集合
</p>
<pre class="example">

</pre>
</div>
</div>

<div id="outline-container-org43d589e" class="outline-3">
<h3 id="org43d589e"><span class="section-number-3">4.3</span> 迭代</h3>
<div class="outline-text-3" id="text-4-3">
<pre class="example">

</pre>
</div>
</div>
</div>

<div id="outline-container-org12c27b3" class="outline-2">
<h2 id="org12c27b3"><span class="section-number-2">5</span> 错误处理</h2>
<div class="outline-text-2" id="text-5">
<p>
有的语言支持异常处理
</p>
</div>
</div>

<div id="outline-container-orge11c9f8" class="outline-2">
<h2 id="orge11c9f8"><span class="section-number-2">6</span> 编码规范</h2>
</div>

<div id="outline-container-org483b528" class="outline-2">
<h2 id="org483b528"><span class="section-number-2">7</span> 高级特性</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org8c364e3" class="outline-3">
<h3 id="org8c364e3"><span class="section-number-3">7.1</span> 闭包</h3>
</div>
<div id="outline-container-org98eea9d" class="outline-3">
<h3 id="org98eea9d"><span class="section-number-3">7.2</span> 模板</h3>
</div>
<div id="outline-container-org5375850" class="outline-3">
<h3 id="org5375850"><span class="section-number-3">7.3</span> 函数重载</h3>
</div>
<div id="outline-container-org94541ab" class="outline-3">
<h3 id="org94541ab"><span class="section-number-3">7.4</span> 反射</h3>
</div>
</div>

<div id="outline-container-org798b31d" class="outline-2">
<h2 id="org798b31d"><span class="section-number-2">8</span> 程序库</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgaf0d750" class="outline-3">
<h3 id="orgaf0d750"><span class="section-number-3">8.1</span> 內建函数</h3>
<div class="outline-text-3" id="text-8-1">
<p>
主要用来操作语言自带的数据类型。
</p>
</div>
</div>

<div id="outline-container-org1e75acc" class="outline-3">
<h3 id="org1e75acc"><span class="section-number-3">8.2</span> 通用函数</h3>
</div>
<div id="outline-container-orgba3888d" class="outline-3">
<h3 id="orgba3888d"><span class="section-number-3">8.3</span> 数据类型</h3>
</div>
<div id="outline-container-org5aec38c" class="outline-3">
<h3 id="org5aec38c"><span class="section-number-3">8.4</span> 字符串</h3>
</div>
<div id="outline-container-org43a52f4" class="outline-3">
<h3 id="org43a52f4"><span class="section-number-3">8.5</span> 输入输出</h3>
</div>
<div id="outline-container-orgcd6f9fd" class="outline-3">
<h3 id="orgcd6f9fd"><span class="section-number-3">8.6</span> 文件</h3>
</div>
<div id="outline-container-orgcc3ea80" class="outline-3">
<h3 id="orgcc3ea80"><span class="section-number-3">8.7</span> 日期</h3>
</div>
<div id="outline-container-org132d13e" class="outline-3">
<h3 id="org132d13e"><span class="section-number-3">8.8</span> 日志</h3>
</div>
<div id="outline-container-org72ed362" class="outline-3">
<h3 id="org72ed362"><span class="section-number-3">8.9</span> 数学</h3>
</div>
<div id="outline-container-org97273eb" class="outline-3">
<h3 id="org97273eb"><span class="section-number-3">8.10</span> unit test</h3>
<div class="outline-text-3" id="text-8-10">
<p>
<a href="https://en.wikipedia.org/wiki/List_of_unit_testing_frameworks">https://en.wikipedia.org/wiki/List_of_unit_testing_frameworks</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org36697c9" class="outline-2">
<h2 id="org36697c9"><span class="section-number-2">9</span> 参考书籍</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org2fe2edf" class="outline-3">
<h3 id="org2fe2edf"><span class="section-number-3">9.1</span> 入门</h3>
</div>
<div id="outline-container-orgdf827b8" class="outline-3">
<h3 id="orgdf827b8"><span class="section-number-3">9.2</span> 高级</h3>
</div>
<div id="outline-container-orgd1c130c" class="outline-3">
<h3 id="orgd1c130c"><span class="section-number-3">9.3</span> 实践</h3>
</div>
<div id="outline-container-orgb6ae932" class="outline-3">
<h3 id="orgb6ae932"><span class="section-number-3">9.4</span> 原理</h3>
</div>
</div>
<div id="outline-container-orgf98250f" class="outline-2">
<h2 id="orgf98250f"><span class="section-number-2">10</span> 相关工具</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgb4faeba" class="outline-3">
<h3 id="orgb4faeba"><span class="section-number-3">10.1</span> 安装运行</h3>
</div>
<div id="outline-container-org4b27cf6" class="outline-3">
<h3 id="org4b27cf6"><span class="section-number-3">10.2</span> 标准命令</h3>
</div>
<div id="outline-container-orgca5f1e2" class="outline-3">
<h3 id="orgca5f1e2"><span class="section-number-3">10.3</span> 集成开发</h3>
</div>
<div id="outline-container-org26c3465" class="outline-3">
<h3 id="org26c3465"><span class="section-number-3">10.4</span> 静态检查</h3>
</div>
<div id="outline-container-orgb1dec53" class="outline-3">
<h3 id="orgb1dec53"><span class="section-number-3">10.5</span> 构建编译</h3>
</div>
<div id="outline-container-org4dde641" class="outline-3">
<h3 id="org4dde641"><span class="section-number-3">10.6</span> 代码调试</h3>
</div>
<div id="outline-container-org4db768f" class="outline-3">
<h3 id="org4db768f"><span class="section-number-3">10.7</span> 内存检查</h3>
</div>
<div id="outline-container-org6c15431" class="outline-3">
<h3 id="org6c15431"><span class="section-number-3">10.8</span> 性能分析</h3>
</div>
<div id="outline-container-orgade90ec" class="outline-3">
<h3 id="orgade90ec"><span class="section-number-3">10.9</span> 自动测试</h3>
</div>
<div id="outline-container-org3ae512f" class="outline-3">
<h3 id="org3ae512f"><span class="section-number-3">10.10</span> 文档系统</h3>
</div>
<div id="outline-container-org62e21dc" class="outline-3">
<h3 id="org62e21dc"><span class="section-number-3">10.11</span> 包管理</h3>
</div>
<div id="outline-container-org5da72ec" class="outline-3">
<h3 id="org5da72ec"><span class="section-number-3">10.12</span> 其他工具</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-04-26 日 10:53</p>
<p class="validation"></p>
</div>
</body>
</html>
